smLab_test/src/InformationRegisters/ПозицииЗакрытияПериода/ПозицииЗакрытияПериода.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПозицииЗакрытияПериода</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ГраницаПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

smLab_test/src/InformationRegisters/ПозицииЗакрытияПериода/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьТекущуюПозициюРегистра(Организация) Экспорт
	
	ТекущаяПозиция = '00010101';
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	КонецПериода(ПозицииЗакрытияПериодаСрезПоследних.ГраницаПериода, День) КАК ГраницаПериода
	|ИЗ
	|	РегистрСведений.ПозицииЗакрытияПериода.СрезПоследних(, Организация = &Организация) КАК
	|		ПозицииЗакрытияПериодаСрезПоследних";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		 Выборка = Результат.Выбрать();
		 Выборка.Следующий();
		 ТекущаяПозиция = Выборка.ГраницаПериода;
	КонецЕсли;
		
	Возврат	ТекущаяПозиция;
	
КонецФункции	

#КонецОбласти

#КонецЕсли
